; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	image0 - mode
	infrared1 - mode
	thermograph4 - mode
	spectrograph3 - mode
	spectrograph2 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph4)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument2 infrared1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 spectrograph3)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite1 Planet9)
	(have_image Phenomenon5 spectrograph2)
	(have_image Phenomenon6 spectrograph3)
	(have_image Phenomenon7 thermograph4)
	(have_image Planet8 image0)
	(have_image Planet9 spectrograph3)
	(have_image Phenomenon10 spectrograph2)
	(have_image Phenomenon11 thermograph4)
	(have_image Phenomenon12 spectrograph2)
))

)

; plan
1. (turn_to satellite1 groundstation2 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 9
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 9
3. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 9
4. (turn_to satellite1 phenomenon12 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon12)
   goals met: 0 of 9
5. (take_image satellite1 phenomenon12 instrument3 spectrograph2)
   added: (have_image phenomenon12 spectrograph2)
   goals met: 1 of 9
6. (turn_to satellite1 phenomenon10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 9
7. (turn_to satellite0 groundstation2 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 9
8. (take_image satellite1 phenomenon10 instrument3 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 2 of 9
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 9
10. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 2 of 9
11. (turn_to satellite0 phenomenon5 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon5)
   goals met: 2 of 9
12. (take_image satellite0 phenomenon5 instrument0 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 3 of 9
13. (turn_to satellite0 planet8 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet8)
   goals met: 3 of 9
14. (take_image satellite0 planet8 instrument0 image0)
   added: (have_image planet8 image0)
   goals met: 4 of 9
15. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 9
16. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 9
17. (turn_to satellite0 groundstation3 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation3)
   goals met: 4 of 9
18. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 4 of 9
19. (turn_to satellite0 phenomenon11 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 9
20. (take_image satellite0 phenomenon11 instrument1 thermograph4)
   added: (have_image phenomenon11 thermograph4)
   goals met: 5 of 9
21. (turn_to satellite0 phenomenon7 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon7)
   goals met: 5 of 9
22. (take_image satellite0 phenomenon7 instrument1 thermograph4)
   added: (have_image phenomenon7 thermograph4)
   goals met: 6 of 9
23. (turn_to satellite1 phenomenon6 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon6)
   goals met: 6 of 9
24. (take_image satellite1 phenomenon6 instrument3 spectrograph3)
   added: (have_image phenomenon6 spectrograph3)
   goals met: 7 of 9
25. (turn_to satellite1 planet9 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet9)
   goals met: 8 of 9
26. (take_image satellite1 planet9 instrument3 spectrograph3)
   added: (have_image planet9 spectrograph3)
   goals met: 9 of 9
